{"format": "layers-model", "generatedBy": "keras v3.13.2", "convertedBy": "farm-companion custom exporter", "modelTopology": {"class_name": "Model", "config": {"name": "plant_health_classifier", "trainable": true, "layers": [{"name": "image", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "image"}, "inbound_nodes": []}, {"name": "conv_1", "class_name": "Conv2D", "config": {"name": "conv_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["image", 0, 0, {}]]]}, {"name": "pool_1", "class_name": "MaxPooling2D", "config": {"name": "pool_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv_1", 0, 0, {}]]]}, {"name": "conv_2", "class_name": "SeparableConv2D", "config": {"name": "conv_2", "trainable": true, "dtype": "float32", "depth_multiplier": 1, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool_1", 0, 0, {}]]]}, {"name": "pool_2", "class_name": "MaxPooling2D", "config": {"name": "pool_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv_2", 0, 0, {}]]]}, {"name": "conv_3", "class_name": "SeparableConv2D", "config": {"name": "conv_3", "trainable": true, "dtype": "float32", "depth_multiplier": 1, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool_2", 0, 0, {}]]]}, {"name": "pool_3", "class_name": "MaxPooling2D", "config": {"name": "pool_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv_3", 0, 0, {}]]]}, {"name": "conv_4", "class_name": "SeparableConv2D", "config": {"name": "conv_4", "trainable": true, "dtype": "float32", "depth_multiplier": 1, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool_3", 0, 0, {}]]]}, {"name": "pool_4", "class_name": "MaxPooling2D", "config": {"name": "pool_4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv_4", 0, 0, {}]]]}, {"name": "global_pool", "class_name": "GlobalAveragePooling2D", "config": {"name": "global_pool", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "inbound_nodes": [[["pool_4", 0, 0, {}]]]}, {"name": "dropout", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "seed": null, "noise_shape": null}, "inbound_nodes": [[["global_pool", 0, 0, {}]]]}, {"name": "class_probabilities", "class_name": "Dense", "config": {"name": "class_probabilities", "trainable": true, "dtype": "float32", "units": 38, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "input_layers": [["image", 0, 0]], "output_layers": [["class_probabilities", 0, 0]]}, "keras_version": "3.13.2", "backend": "tensorflow"}, "weightsManifest": [{"paths": ["weights.bin"], "weights": [{"name": "conv_1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv_2/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "conv_2/pointwise_kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "conv_2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv_3/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv_3/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "conv_3/bias", "shape": [128], "dtype": "float32"}, {"name": "conv_4/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_4/pointwise_kernel", "shape": [1, 1, 128, 192], "dtype": "float32"}, {"name": "conv_4/bias", "shape": [192], "dtype": "float32"}, {"name": "class_probabilities/kernel", "shape": [192, 38], "dtype": "float32"}, {"name": "class_probabilities/bias", "shape": [38], "dtype": "float32"}]}]}